posts/calibre_digital_library.html
<!DOCTYPE html><html><head><!-- 2025-03-14 --><!-- 2026-01-28 Wed 15:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Digital library using calibre</title>
<meta name="generator" content="Org Mode" />
<link href="https://fonts.cdnfonts.com/css/share-tech-mono" rel="stylesheet"><link rel="stylesheet" type="text/css" href="/assets/code.css"/><link rel="stylesheet" type="text/css" href="/assets/style.css"/>
</head><body><header><div class="container"><h1>Gold Ayan's Tinker Garage</h1></div><div class="header-content"><nav class="container"><ul class="topnav"><li><a href="/index.html">Home</a></li><li><a href="/projects.html">Projects</a></li><li><a href="/posts">Posts</a></li><li><a href="/til.html">TIL</a></li><li><a href="/blogrolls.html">Blogrolls</a></li><li><a href="/feed.xml">RSS</a></li></ul></nav></div></header><article class="container"><div class="blog-content"><p>
Looking for a software to manage my ebooks. almost everyone recommends to calibre
</p>

<div id="outline-container-org925eb75" class="outline-2">
<h2 id="org925eb75">Installing</h2>
<div class="outline-text-2" id="text-org925eb75">
<p>
Binary installation
</p>
<div class="org-src-container">
<pre class="src src-shell">sudo -v &amp;&amp; wget -nv -O- https://download.calibre-ebook.com/linux-installer.sh | sudo sh /dev/stdin
</pre>
</div>

<p>
once installed i am able to open the calibre
</p>
</div>
</div>

<div id="outline-container-orgb9b68c3" class="outline-2">
<h2 id="orgb9b68c3">Library path</h2>
<div class="outline-text-2" id="text-orgb9b68c3">
<p>
you can change the location where the books are stored by clicking the
<b>Calibre library</b> in tool bar. The default location will be
</p>
<pre class="example" id="org754663c">
~/Calibre Library
</pre>
</div>
</div>

<div id="outline-container-orgebf0e79" class="outline-2">
<h2 id="orgebf0e79">Appearance changes</h2>
<div class="outline-text-2" id="text-orgebf0e79">
<p>
Default appearance of the calibre looks pretty old let's change
it. select preference and click look &amp; feel
</p>
<ul class="org-ul">
<li>Dark mode</li>
<li>Set the font to Jet brains Mono nerd font (My preference)</li>
<li>Change the icon pack to Monstre</li>
</ul>

<p>
You can select different layout option using <b>layout</b> button in the status bar
</p>
</div>
</div>

<div id="outline-container-org633c022" class="outline-2">
<h2 id="org633c022">Adding book</h2>
<div class="outline-text-2" id="text-org633c022">
<p>
You can start adding books
</p>
<ul class="org-ul">
<li>By drag and dropping the books</li>
<li>Add books button</li>
<li>Using calibredb command</li>
</ul>


<p>
When you are trying to access calibre functions from the terminal
ensure the GUI application is not opened or it will raise some errors
</p>
</div>
</div>

<div id="outline-container-orga303fef" class="outline-2">
<h2 id="orga303fef">Calibredb</h2>
<div class="outline-text-2" id="text-orga303fef">
<p>
One of the coolest way to add books is to use <b>calibredb</b> command line tool. Check whether calibredb is accesible from terminal using the following command
</p>
<div class="org-src-container">
<pre class="src src-shell">calibredb list
</pre>
</div>
<p>
This will list all the books available in calibre. To add new books to the library
</p>
<div class="org-src-container">
<pre class="src src-shell">calibredb add [options] file1 file2
</pre>
</div>
<p>
you can more operation using calibredb like editing meta data, remove ebook.
</p>
</div>
</div>

<div id="outline-container-orge526427" class="outline-2">
<h2 id="orge526427">Calibre web server</h2>
<div class="outline-text-2" id="text-orge526427">
<ul class="org-ul">
<li><p>
Start the web server using following command
</p>
<div class="org-src-container">
<pre class="src src-shell">calibre-server
</pre>
</div></li>
<li><p>
Web server with custom port
</p>
<div class="org-src-container">
<pre class="src src-shell">calibre-server --port=9876
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-org17b121d" class="outline-2">
<h2 id="org17b121d">OPDS</h2>
<div class="outline-text-2" id="text-org17b121d">
<ul class="org-ul">
<li>OPDS is a protocol to access your ebook library in other devices</li>
<li>URL for your OPDS is <b>HOSTNAME:PORT/opds</b> eg: 192.268.1.10:8080/opds</li>
<li>Software that i use to consume content from OPDS
<ul class="org-ul">
<li>Foliate (linux ebook reader)
<ul class="org-ul">
<li><a href="https://johnfactotum.github.io/foliate/">https://johnfactotum.github.io/foliate/</a></li>
</ul></li>
<li>Librera Reader (Android)
<ul class="org-ul">
<li><a href="https://github.com/foobnix/LibreraReader">https://github.com/foobnix/LibreraReader</a></li>
<li>Download the Pro version from github repo.</li>
<li>Network tab in the app</li>
<li>If network tab is not there then reset(not reinstall) the app</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org777b5e9" class="outline-2">
<h2 id="org777b5e9">Convert ebooks from terminal</h2>
<div class="outline-text-2" id="text-org777b5e9">
<ul class="org-ul">
<li><p>
you can convert books from GUI. i prefer terminal tools
</p>
<div class="org-src-container">
<pre class="src src-shell">ebook-convert input_file output_file [options]
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-org28731c6" class="outline-2">
<h2 id="org28731c6">Backuping up</h2>
<div class="outline-text-2" id="text-org28731c6">
<p>
To backup the library all we need is to copy the content of <b>Calibre
Library</b> like a monthly once or twice. Depends on your needs
</p>
</div>
</div>

<div id="outline-container-orgaa10379" class="outline-2">
<h2 id="orgaa10379">Others</h2>
<div class="outline-text-2" id="text-orgaa10379">
<ul class="org-ul">
<li><a href="https://github.com/janeczku/calibre-web">https://github.com/janeczku/calibre-web</a>
<ul class="org-ul">
<li>If you are not satisfied with web server that comes with calibre you can look into this.</li>
</ul></li>
<li>If you are okay with self hosting you can try <b>Kavita</b> - <a href="https://www.kavitareader.com/">https://www.kavitareader.com/</a></li>
</ul>
</div>
</div>
</div></article><footer>This site is made with ❤️ using Emacs.</footer></body></html>
